Revit 2026 API

# ForgeTypeId Properties

---

The ForgeTypeId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TypeId | The schema identifier. |

#### Reference

ForgeTypeId Class

Autodesk.Revit.DB Namespace